#include <stdio.h>

int main() {
    // Дані для виводу
    int x[] = {1, 2, 3, 4, 5};
    double y[] = {3.0, 1.0, 5.0, 4.0, 2.1};

    // Вивід першого рядка (x)
    printf(" x |");
    for(int i = 0; i < 5; i++) {
        printf(" %d  |", x[i]);
    }
    
    // Вивід розділювача
    printf("\n---|----|----|----|----|----|\n");

    // Вивід другого рядка (y)
    printf(" y |");
    for(int i = 0; i < 5; i++) {
        // %3.1f забезпечує один знак після коми
        printf(" %.1f |", y[i]);
    }
    printf("\n");

    return 0;
}